{
  "additional_special_tokens": [
    "ar_AR",
    "cs_CZ",
    "de_DE",
    "en_XX",
    "es_XX",
    "et_EE",
    "fi_FI",
    "fr_XX",
    "gu_IN",
    "hi_IN",
    "it_IT",
    "ja_XX",
    "kk_KZ",
    "ko_KR",
    "lt_LT",
    "lv_LV",
    "my_MM",
    "ne_NP",
    "nl_XX",
    "ro_RO",
    "ru_RU",
    "si_LK",
    "tr_TR",
    "vi_VN",
    "zh_CN",
    "gl_EN",
    "<id>",
    "<ood>"
  ],
  "bos_token": "<s>",
  "cls_token": "<s>",
  "eos_token": "</s>",
  "mask_token": {
    "__type": "AddedToken",
    "content": "<mask>",
    "lstrip": true,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "model_max_length": 1024,
  "name_or_path": "facebook/mbart-large-en-ro",
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "special_tokens_map_file": null,
  "src_lang": "en_XX",
  "tgt_lang": "ro_RO",
  "tokenizer_class": "MBartTokenizer",
  "unk_token": "<unk>"
}
